УчетВУправляющихДляГит1/src/InformationRegisters/НастройкаЗаполненияФормСтатистики/НастройкаЗаполненияФормСтатистики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаполненияФормСтатистики</name>
  <resources>
    <name>Заполнять</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Настройка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеНастройки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектНаблюдения</name>
    <type>
      <types>CatalogRef.ОбъектыСтатистическогоНаблюдения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ЗадачиНачалаРаботы/ЗадачиНачалаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗадачиНачалаРаботы</name>
  <enumValues>
    <name>СписокНалоговОтчетов</name>
  </enumValues>
  <enumValues>
    <name>НастройкаЗаполненияФормСтатистики</name>
  </enumValues>
  <enumValues>
    <name>Подключение1СОтчетности</name>
  </enumValues>
  <enumValues>
    <name>Подключение1СЭДО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДоступКОрганизациям</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРеквизитыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>УдалитьБыстрыйСтарт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВидеоурок</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПараметрыУчета</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУчетнаяПолитика</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНачальныеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНастройкаТорговыхТочек</name>
  </enumValues>
  <enumValues>
    <name>ОплатитьЗадолженностьПоНалогамВзносам</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/СпособыОбменаЭД/СпособыОбменаЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОбменаЭД</name>
  <enumValues>
    <name>БыстрыйОбмен</name>
  </enumValues>
  <enumValues>
    <name>ЧерезFTP</name>
  </enumValues>
  <enumValues>
    <name>ЧерезКаталог</name>
  </enumValues>
  <enumValues>
    <name>ЧерезОператораЭДОТакском</name>
    <comment>Через оператора электронного документооборота Такском</comment>
  </enumValues>
  <enumValues>
    <name>ЧерезСервис1СЭДО</name>
  </enumValues>
  <enumValues>
    <name>ЧерезЭлектроннуюПочту</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЧерезВебРесурсБанка</name>
  </enumValues>
  <enumValues>
    <name>Через1СБизнесСеть</name>
  </enumValues>
  <enumValues>
    <name>Интеркампани</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/CommonModules/ЗадачиБухгалтераКлиентСервер/Module.bsl
Функция Идентификатор(Имя) Экспорт
	
	Цифры = "1234567890";
	НомерСтрокой = "";
	ДлинаИмени = СтрДлина(Имя);
	Для Индекс = 0 По ДлинаИмени - 1 Цикл
		Позиция = ДлинаИмени - Индекс;
		Символ = Сред(Имя,Позиция,1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		НомерСтрокой = Символ + НомерСтрокой;
	КонецЦикла;
	
	Если ПустаяСтрока(НомерСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(НомерСтрокой) - 1;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция НомерКонтейнера(Индекс) Экспорт
	
	Возврат Формат(Индекс + 1, "ЧГ=0");
	
КонецФункции

Функция СсылкаНаИТС(Срок = Неопределено) Экспорт
	
	Если Срок = Неопределено Тогда
		Параметры = "";
	Иначе
		Параметры = "/?date=" + Формат(Срок, "ДФ=yyyyMMdd");
	КонецЕсли;
	
	Возврат "http://its.1c.ru/calendar" + Параметры;
	
КонецФункции

Функция ОписаниеДействия(ПараметрыКоманды) Экспорт
	
	Если ТипЗнч(ПараметрыКоманды.Правило) = Тип("ПеречислениеСсылка.ЗадачиНачалаРаботы") Тогда
		
		Если ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.СписокНалоговОтчетов") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "ОбщаяФорма.НалогиИОтчеты");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СОтчетности") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ПредложениеОформитьЗаявлениеНаПодключение");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СЭДО") Тогда
			
			СпособыОЭД = Новый Массив;
			СпособыОЭД.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОбменаЭД.ЧерезСервис1СЭДО"));
			
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("СпособыОбменаЭД", СпособыОЭД);
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Справочник.ПрофилиНастроекЭДО.Форма.ПомощникПодключенияЭДО");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.НастройкаЗаполненияФормСтатистики") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "РегистрСведений.НастройкаЗаполненияФормСтатистики.Форма.НастройкаЗаполненияФормСтатистики");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.ОплатитьЗадолженностьПоНалогамВзносам") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Обработка.ПомощникУплатыНалоговВзносовПрошлыхЛет.Форма.ФормаВводаНачальныхОстатковИнтеграцияСБанком");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли
		
	ИначеЕсли ТипЗнч(ПараметрыКоманды.Правило) = Тип("СправочникСсылка.ПроверкиКонтролирующимиОрганами") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",        ПараметрыКоманды.Правило);
		ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
		
		ОписаниеДействия = Новый Структура;
		ОписаниеДействия.Вставить("ИмяФормы",       "Справочник.ПроверкиКонтролирующимиОрганами.Форма.ФормаПросмотра");
		ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
		
	Иначе
		
		ОписаниеДействия = ВыполнениеЗадачБухгалтераВызовСервера.ОписаниеДействия(ПараметрыКоманды);
		
	КонецЕсли;
	
	Возврат ОписаниеДействия;
	
КонецФункции

Функция СрокПредупрежденияПриОграниченииСпособовОтправки() Экспорт
	
	Возврат 5; // 5 дней - достаточно дойти до учреждения или отправить почтой
	
КонецФункции

#Область КодыЗадач

Функция КодЗадачиУСН() Экспорт
	
	Возврат "УСН";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносы() Экспорт
	
	Возврат "СтраховыеВзносы";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносыИП() Экспорт
	
	Возврат "СтраховыеВзносы_Предприниматель";
	
КонецФункции

Функция КодЗадачиНДФЛ() Экспорт
	
	Возврат "НДФЛ";
	
КонецФункции

Функция КодЗадачиНДФЛПоУплате() Экспорт
	
	Возврат "НДФЛ_Агент_Уплата";
	
КонецФункции

Функция КодЗадачиНДФЛПоОтчету() Экспорт
	
	Возврат "НДФЛ_Агент";
	
КонецФункции

Функция КодЗадачиСреднесписочнаяЧисленность() Экспорт
	
	Возврат "СведенияОСреднесписочнойЧисленности";
	
КонецФункции

Функция КодЗадачиСтатистика() Экспорт
	
	Возврат "СтатистическаяОтчетность";
	
КонецФункции

Функция КодЗадачиПатент() Экспорт
	
	Возврат "Патент";
	
КонецФункции

Функция КодЗадачиЕНВД() Экспорт
	
	Возврат "ЕНВД";
	
КонецФункции

Функция КодЗадачиТорговыйСбор() Экспорт
	
	Возврат "ТорговыйСбор";
	
КонецФункции

Функция КодЗадачиНалогНаПрофессиональныйДоход() Экспорт
	
	Возврат "НалогНаПрофессиональныйДоход";
	
КонецФункции

#КонецОбласти
